<a href="https://colab.research.google.com/github/Jesi1511/Jesi1511/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Import library
import sqlite3

# Connect to an SQLite database; use ':memory:' for an in-memory database
con = sqlite3.connect(':memory:')

In [ ]:
# Execute a SQL command to create a new table
c = con.cursor()
c.execute('''
          CREATE TABLE stocks
          (date text, trans text, symbol text, qty real, price real)
          ''')

In [ ]:
# Execute a SQL command to insert data into the table
c.execute("INSERT INTO stocks VALUES ('2006-01-05','BUY','ABC',100,35.14)")

# Commit the transaction to save changes to the database
con.commit()

In [ ]:
# Execute a SQL SELECT statement to query the database
c.execute("SELECT * FROM stocks WHERE trans='BUY'")

# Fetch all rows from the result of the query
print(c.fetchall())

[('2006-01-05', 'BUY', 'ABC', 100.0, 35.14)]

In [ ]:
# Execute a SQL command to create a new table
c = con.cursor()
c.execute('''create table Student(ID INTEGER PRIMARY KEY,NAME TEXT NOT NULL,EMAIL TEXT,MARKS FLOAT);
''')

In [ ]:
c.execute('''
INSERT INTO STUDENT values (1,'Shweta','shweta@gmail.com',80),
(2,'Yamini','rani@gmail.com', 60),
(3,'Sonal','sonal@gmail.com', 50),
(4,'Jagruti','jagu@gmail.com', 30);''')
con.commit()

In [ ]:
c.execute('''select * from STUDENT''')

In [ ]:
print(c.fetchall())

[(1, 'Shweta', 'shweta@gmail.com', 80.0), (2, 'Yamini', 'rani@gmail.com', 60.0), (3, 'Sonal', 'sonal@gmail.com', 50.0), (4, 'Jagruti', 'jagu@gmail.com', 30.0)]

In [ ]:
c.execute('''SELECT ID, NAME, MARKS,
CASE
WHEN MARKS >=80 THEN 'A+'
WHEN MARKS >=70 THEN 'A'
WHEN MARKS >=60 THEN 'B'
WHEN MARKS >=50 THEN 'C'
ELSE 'Sorry!! Failed'
END as 'Grade'
FROM STUDENT;''')
print(c.fetchall())

[(1, 'Shweta', 80.0, 'A+'), (2, 'Yamini', 60.0, 'B'), (3, 'Sonal', 50.0, 'C'), (4, 'Jagruti', 30.0, 'Sorry!! Failed')]

In [ ]:
c.execute('''CREATE TABLE Person
(SSID INTEGER PRIMARY KEY,
first_name TEXT NOT NULL,
last_name TEXT NOT NULL,
email TEXT,
phone_no TEXT,
city TEXT);''')

In [ ]:
c.execute('''INSERT INTO Person
values (1,'Vinay','Jariwala','vinay@gmail.com','898545','Vapi'),
(2,'Shweta','Rana','Shweta@gmail.com','888875','Valsad'),
(3,'Sonal','Menpara','Sonal@gmail.com','84697','Surat'),
(4,'Jagruti','Viras','jagu@gmail.com','656454','Daman'),
(5,'Yamini','Patel','rani@gmail.com','98788','Mumbai');''')

In [ ]:
c.execute('''INSERT INTO Person (SSID,first_name,last_name,email,city)
Values (6,'Yami','Patel','yamini@gmail.com','Surat'),
(7,'Jagruti','Viras','jagu@gmail.com','Daman'),
(8,'Yaaami','Paaatel','yaaaamini@gmail.com','Suraaat');''')

In [ ]:
c.execute('''SELECT * FROM Person;''')
print(c.fetchall())

[(1, 'Vinay', 'Jariwala', 'vinay@gmail.com', '898545', 'Vapi'), (2, 'Shweta', 'Rana', 'Shweta@gmail.com', '888875', 'Valsad'), (3, 'Sonal', 'Menpara', 'Sonal@gmail.com', '84697', 'Surat'), (4, 'Jagruti', 'Viras', 'jagu@gmail.com', '656454', 'Daman'), (5, 'Yamini', 'Patel', 'rani@gmail.com', '98788', 'Mumbai'), (6, 'Yami', 'Patel', 'yamini@gmail.com', None, 'Surat'), (7, 'Jagruti', 'Viras', 'jagu@gmail.com', None, 'Daman'), (8, 'Yaaami', 'Paaatel', 'yaaaamini@gmail.com', None, 'Suraaat')]

In [ ]:
c.execute('''SELECT * FROM Person WHERE phone_no IS NULL;''')
print(c.fetchall())

[(6, 'Yami', 'Patel', 'yamini@gmail.com', None, 'Surat'), (7, 'Jagruti', 'Viras', 'jagu@gmail.com', None, 'Daman'), (8, 'Yaaami', 'Paaatel', 'yaaaamini@gmail.com', None, 'Suraaat')]

In [ ]:
c.execute('''SELECT * FROM Person WHERE phone_no IS not NULL;''')
print(c.fetchall())

[(1, 'Vinay', 'Jariwala', 'vinay@gmail.com', '898545', 'Vapi'), (2, 'Shweta', 'Rana', 'Shweta@gmail.com', '888875', 'Valsad'), (3, 'Sonal', 'Menpara', 'Sonal@gmail.com', '84697', 'Surat'), (4, 'Jagruti', 'Viras', 'jagu@gmail.com', '656454', 'Daman'), (5, 'Yamini', 'Patel', 'rani@gmail.com', '98788', 'Mumbai')]